{
  "Present_Simple_Tense": "# Present Simple Tense\n\nThe present simple tense is used to describe actions that are habitual, routine, or facts that are generally true.\n\n## Usage\n\n- **Habitual Actions**: Describing actions that happen regularly or repeatedly.\n- **Facts and General Truths**: Stating facts that are always true.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the present simple tense uses the base form of the verb.\n\nExample:\n```\nI play tennis every Saturday.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"do not\" (don't) or \"does not\" (doesn't) before the base form of the verb.\n\nExample:\n```\nShe doesn't like coffee.\n```\n\n### Question Form\n\nTo form questions in the present simple tense, we use \"do\" or \"does\" before the subject.\n\nExample:\n```\nDo you speak Spanish?\n```\n\n## Signal Words\n\nSignal words often associated with the present simple tense include:\n- Always\n- Usually\n- Often\n- Sometimes\n- Rarely\n- Never\n\n## Examples\n\n- **Habitual Action**: He always wakes up early in the morning.\n- **Facts**: The sun rises in the east.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - Sarah __________ (play) the piano every day.\n   - They __________ (not like) spicy food.\n   - What time __________ Tom usually __________ (finish) work?\n2. Write five sentences describing your daily routine using the present simple tense.",
  "Present_Continuous_Tense": "# Present Continuous Tense\n\nThe present continuous tense is used to describe actions that are happening at the moment of speaking or actions that are currently in progress.\n\n## Usage\n\n- **Actions Happening Now**: Describing actions that are occurring at the present moment.\n- **Temporary Situations**: Describing temporary situations or actions that are in progress.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the present continuous tense uses the present participle form of the verb (verb + -ing).\n\nExample:\n```\nI am reading a book.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"not\" after the auxiliary verb \"am/is/are\".\n\nExample:\n```\nShe is not watching TV.\n```\n\n### Question Form\n\nTo form questions in the present continuous tense, we use the auxiliary verbs \"am/is/are\" at the beginning of the sentence.\n\nExample:\n```\nAre you studying for your exam?\n```\n\n## Signal Words\n\nSignal words often associated with the present continuous tense include:\n- Now\n- At the moment\n- Currently\n- Right now\n\n## Examples\n\n- **Actions Happening Now**: He is talking on the phone.\n- **Temporary Situations**: I am staying with my friend until my apartment is ready.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - They __________ (study) for their exams at the moment.\n   - Sarah usually __________ (watch) TV in the evenings, but tonight she __________ (read) a book.\n   - Why __________ you __________ (wear) a coat? It's not cold.\n2. Write five sentences describing what you are doing at this moment using the present continuous tense.",
  "Present_Perfect_Tense": "# Present Perfect Tense\n\nThe present perfect tense is used to describe actions that have been completed in the past but have relevance to the present.\n\n## Usage\n\n- **Completed Actions with Present Relevance**: Describing actions that occurred at an unspecified time in the past but have a connection to the present moment.\n- **Experiences**: Talking about life experiences.\n- **Changes Over Time**: Describing changes or developments that have occurred over a period leading up to the present.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the present perfect tense uses the auxiliary verb \"have\" (for subjects \"I\", \"you\", \"we\", \"they\") or \"has\" (for subjects \"he\", \"she\", \"it\") followed by the past participle form of the main verb.\n\nExample:\n```\nI have finished my homework.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"not\" after the auxiliary verb \"have\" or \"has\".\n\nExample:\n```\nShe has not visited Paris.\n```\n\n### Question Form\n\nTo form questions in the present perfect tense, we use the auxiliary verbs \"have\" or \"has\" at the beginning of the sentence.\n\nExample:\n```\nHave you ever traveled abroad?\n```\n\n## Signal Words\n\nSignal words often associated with the present perfect tense include:\n- Ever\n- Never\n- Already\n- Yet\n- Just\n- Recently\n- Lately\n\n## Examples\n\n- **Completed Actions with Present Relevance**: She has lost her keys. (and she can't get into her house now)\n- **Experiences**: I have traveled to Japan three times.\n- **Changes Over Time**: Prices have increased significantly over the past year.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - I __________ (never/be) to Canada.\n   - Tom __________ (not/finish) his assignment yet.\n   - __________ she __________ (see) the new movie?\n2. Write five sentences about your experiences using the present perfect tense.",
  "Present_Perfect_Continuous_Tense": "# Present Perfect Continuous Tense\n\nThe present perfect continuous tense is used to describe actions that started in the past and are still continuing into the present moment.\n\n## Usage\n\n- **Actions Started in the Past and Still Continuing**: Describing actions that began at some point in the past and are still ongoing.\n- **Emphasizing Duration**: Emphasizing the duration of an action that has been happening over a period of time.\n- **Temporary Situations**: Describing temporary situations or states that have been continuing for some time.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the present perfect continuous tense uses the auxiliary verb \"have been\" (for subjects \"I\", \"you\", \"we\", \"they\") or \"has been\" (for subjects \"he\", \"she\", \"it\") followed by the present participle form of the main verb (-ing form).\n\nExample:\n```\nI have been working on this project for two hours.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"not\" after the auxiliary verb \"have been\" or \"has been\".\n\nExample:\n```\nShe has not been studying English for very long.\n```\n\n### Question Form\n\nTo form questions in the present perfect continuous tense, we use the auxiliary verbs \"have\" or \"has\" followed by the subject, and then 'been', and finally the present participle form of the main verb (-ing form).\n\nExample:\n```\nHave you been waiting for a long time?\n```\n\n## Signal Words\n\nSignal words often associated with the present perfect continuous tense include:\n- For\n- Since\n- All day\n- How long\n\n## Examples\n\n- **Actions Started in the Past and Still Continuing**: I have been learning Spanish for three years.\n- **Emphasizing Duration**: He has been working on his thesis since early morning.\n- **Temporary Situations**: She has been feeling unwell lately.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - They __________ (wait) for you for over an hour.\n   - She __________ (study) English for two hours.\n   - How long __________ you __________ (learn) to play the guitar?\n2. Write five sentences describing what you have been doing recently using the present perfect continuous tense.",
  "Past_Simple_Tense": "# Past Simple Tense\n\nThe past simple tense is used to describe actions that were completed in the past.\n\n## Usage\n\n- **Completed Actions in the Past**: Describing actions that happened at a specific point in the past.\n- **Habits or Routines in the Past**: Talking about actions that were repeated or habitual in the past.\n- **Narrating Past Events**: Telling stories or recounting past events.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the past simple tense uses the past form of the verb.\n\nExample:\n```\nI visited Paris last summer.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"did not\" (didn't) before the base form of the verb.\n\nExample:\n```\nShe didn't eat breakfast this morning.\n```\n\n### Question Form\n\nTo form questions in the past simple tense, we use the auxiliary verb \"did\" followed by the subject and the base form of the verb.\n\nExample:\n```\nDid you see that movie last night?\n```\n\n## Signal Words\n\nSignal words often associated with the past simple tense include:\n- Yesterday\n- Last week/month/year\n- Ago\n- In (year)\n- When\n\n## Examples\n\n- **Completed Actions in the Past**: He finished his homework before dinner.\n- **Habits or Routines in the Past**: She always walked to school when she was young.\n- **Narrating Past Events**: The sun set, and darkness fell over the city.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - They __________ (go) to the beach yesterday.\n   - He __________ (not/finish) his work on time.\n   - __________ she __________ (see) the new movie?\n2. Write five sentences about your last weekend using the past simple tense.",
  "Past_Continuous_Tense": "# Past Continuous Tense\n\nThe past continuous tense is used to describe actions that were in progress at a specific moment in the past.\n\n## Usage\n\n- **Actions in Progress in the Past**: Describing actions that were ongoing at a particular time in the past.\n- **Background Actions**: Providing background information or context for other events in the past.\n- **Interrupted Actions**: Describing actions that were happening when another action occurred.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the past continuous tense uses the past form of the verb \"to be\" (was/were) followed by the present participle form of the main verb (verb + -ing).\n\nExample:\n```\nI was reading a book when the phone rang.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"not\" after the past form of the verb \"to be\" (was/were).\n\nExample:\n```\nShe wasn't studying when I saw her.\n```\n\n### Question Form\n\nTo form questions in the past continuous tense, we invert the subject and the past form of the verb \"to be\" (was/were).\n\nExample:\n```\nWere you watching TV at 9 PM last night?\n```\n\n## Signal Words\n\nSignal words often associated with the past continuous tense include:\n- While\n- When\n- As\n- At (specific time)\n\n## Examples\n\n- **Actions in Progress in the Past**: They were playing football when it started raining.\n- **Background Actions**: The children were sleeping when the guests arrived.\n- **Interrupted Actions**: I was studying when the electricity went out.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - While I __________ (watch) TV, she __________ (cook) dinner.\n   - They __________ (not/listen) to music when I arrived.\n   - __________ he __________ (talk) to her when the accident happened?\n2. Write five sentences about what you were doing at a specific time yesterday using the past continuous tense.",
  "Past_Perfect_Tense": "# Past Perfect Tense\n\nThe past perfect tense is used to describe an action that happened before another action in the past.\n\n## Usage\n\n- **Action Completed Before Another Past Action**: Describing an action that was completed before another action took place in the past.\n- **Narrating Past Events**: Providing background information or context for events that happened earlier in the past.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the past perfect tense uses the past form of the auxiliary verb \"had\" followed by the past participle form of the main verb.\n\nExample:\n```\nShe had already finished her work when I arrived.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"not\" after the past form of the auxiliary verb \"had\".\n\nExample:\n```\nHe had not seen that movie before.\n```\n\n### Question Form\n\nTo form questions in the past perfect tense, we invert the subject and the past form of the auxiliary verb \"had\".\n\nExample:\n```\nHad you ever been to Paris before last summer?\n```\n\n## Signal Words\n\nSignal words often associated with the past perfect tense include:\n- Before\n- Already\n- Just\n- By the time\n\n## Examples\n\n- **Action Completed Before Another Past Action**: She had already left when I arrived.\n- **Narrating Past Events**: By the time we got to the cinema, the movie had already started.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - They __________ (finish) dinner before the guests arrived.\n   - She __________ (not/visit) Europe until last year.\n   - __________ you __________ (ever/be) to Japan before?\n2. Write five sentences about what had happened before a specific event using the past perfect tense.",
  "Past_Perfect_Continuous_Tense": "# Past Perfect Continuous Tense\n\nThe past perfect continuous tense is used to describe actions that were ongoing for a period of time in the past before another action occurred.\n\n## Usage\n\n- **Continuous Duration Until a Point in the Past**: Describing actions that were ongoing for a period of time before another past action.\n- **Emphasizing Duration**: Emphasizing the duration of an action that was ongoing before a specific point in the past.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the past perfect continuous tense uses the past perfect tense of the auxiliary verb \"had\" followed by \"been\", and then the present participle form of the main verb (-ing form).\n\nExample:\n```\nShe had been studying for two hours before her friends arrived.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"not\" after the auxiliary verb \"had\".\n\nExample:\n```\nThey had not been waiting for long when the bus finally arrived.\n```\n\n### Question Form\n\nTo form questions in the past perfect continuous tense, we use the past perfect tense of the auxiliary verb \"had\" before the subject, followed by the subject, then \"been\", and finally the present participle form of the main verb (-ing form).\n\nExample:\n```\nHad you been waiting for long when the phone rang?\n```\n\n## Signal Words\n\nSignal words often associated with the past perfect continuous tense include:\n- For\n- Since\n- How long\n\n## Examples\n\n- **Continuous Duration Until a Point in the Past**: She had been living in Paris for five years before she moved to London.\n- **Emphasizing Duration**: By the time he left, I had been working on the project for two months.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - She __________ (wait) for over an hour when I finally arrived.\n   - By the time we got there, they __________ (work) on the project for days.\n   - How long __________ you __________ (study) before the exam?\n2. Write five sentences describing what you had been doing for a certain duration before a specific past event using the past perfect continuous tense.",
  "Future_Simple_Tense": "# Future Simple Tense\n\nThe future simple tense is used to describe actions that will happen in the future.\n\n## Usage\n\n- **Predictions**: Making predictions about the future.\n- **Spontaneous Decisions**: Making decisions at the moment of speaking.\n- **Promises and Offers**: Making promises or offers.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the future simple tense uses the modal auxiliary verb \"will\" followed by the base form of the main verb.\n\nExample:\n```\nI will call you tomorrow.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"will not\" (won't) before the base form of the verb.\n\nExample:\n```\nShe won't arrive until next week.\n```\n\n### Question Form\n\nTo form questions in the future simple tense, we use the modal auxiliary verb \"will\" before the subject.\n\nExample:\n```\nWill you come to the party?\n```\n\n## Signal Words\n\nSignal words often associated with the future simple tense include:\n- Tomorrow\n- Next week\n- In the future\n- Soon\n\n## Examples\n\n- **Predictions**: It will rain tomorrow.\n- **Spontaneous Decisions**: I'll have pizza for dinner tonight.\n- **Promises and Offers**: I will help you with your homework.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - We __________ (go) to the beach next Sunday.\n   - She __________ (not come) to the party tonight.\n   - What time __________ you __________ (arrive) at the airport tomorrow?\n2. Write five sentences describing your plans for the future using the future simple tense.",
  "Future_Continuous_Tense": "# Future Continuous Tense\n\nThe future continuous tense is used to describe actions that will be happening at a specific time in the future.\n\n## Usage\n\n- **Actions in Progress at a Future Time**: Describing actions that will be in progress at a specific time in the future.\n- **Future Interruptions**: Describing actions that will be interrupted by another action in the future.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the future continuous tense uses the modal auxiliary verb \"will\" followed by the verb \"be\" in its present participle form (-ing form), and then the base form of the main verb.\n\nExample:\n```\nI will be studying at 8 o'clock tomorrow.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"will not be\" before the verb in its present participle form (-ing form).\n\nExample:\n```\nShe will not be working on Monday.\n```\n\n### Question Form\n\nTo form questions in the future continuous tense, we use the modal auxiliary verb \"will\" before the subject, then the verb \"be\" in its present participle form (-ing form), and finally the base form of the main verb.\n\nExample:\n```\nWill you be sleeping when I arrive?\n```\n\n## Signal Words\n\nSignal words often associated with the future continuous tense include specific future time expressions such as:\n- At 8 o'clock tomorrow\n- Next week at this time\n- This time tomorrow\n\n## Examples\n\n- **Actions in Progress at a Future Time**: They will be having dinner at 7 PM tomorrow.\n- **Future Interruptions**: She will be watching TV when you call her.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - At this time tomorrow, we __________ (have) dinner with our friends.\n   - She __________ (not work) at 9 PM tonight.\n   - What __________ you __________ (do) this time next week?\n2. Write five sentences describing what you will be doing at a specific time in the future using the future continuous tense.",
  "Future_Perfect_Tense": "# Future Perfect Tense\n\nThe future perfect tense is used to describe actions that will be completed at some point in the future before another action or time.\n\n## Usage\n\n- **Completion Before a Future Point**: Describing actions that will be finished before a specific point in the future.\n- **Assumptions About the Past**: Making assumptions or predictions about completed actions in the future.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the future perfect tense uses the future tense of the auxiliary verb \"will\" followed by the past participle form of the main verb.\n\nExample:\n```\nBy this time next year, she will have graduated from university.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"not\" after the auxiliary verb \"will\".\n\nExample:\n```\nI will not have finished my work by the time you arrive.\n```\n\n### Question Form\n\nTo form questions in the future perfect tense, we use the auxiliary verb \"will\" before the subject, followed by the subject, then \"have\", and finally the past participle form of the main verb.\n\nExample:\n```\nWill you have completed the project by next Friday?\n```\n\n## Signal Words\n\nSignal words often associated with the future perfect tense include:\n- By the time\n- By\n- Before\n\n## Examples\n\n- **Completion Before a Future Point**: By the time she returns, I will have finished cooking dinner.\n- **Assumptions About the Past**: They will have left by the time we get there.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - By next summer, he __________ (finish) his degree.\n   - I __________ (not/start) the project by the time you arrive.\n   - How many books __________ you __________ (read) by the end of the year?\n2. Write five sentences describing what you will have accomplished by a future date using the future perfect tense.",
  "Future_Perfect_Continuous_Tense": "# Future Perfect Continuous Tense\n\nThe future perfect continuous tense is used to describe actions that will continue up until a point in the future and will be completed at that time.\n\n## Usage\n\n- **Continuous Duration Until a Future Point**: Describing actions that will continue up until a specified point in the future.\n- **Emphasizing Duration**: Emphasizing the duration of an action that will be ongoing up to a certain time in the future.\n\n## Form\n\n### Affirmative Form\n\nThe affirmative form of the future perfect continuous tense uses the future tense of the auxiliary verb \"will\" followed by \"have been\", and then the present participle form of the main verb (-ing form).\n\nExample:\n```\nBy the time he arrives, I will have been waiting for two hours.\n```\n\n### Negative Form\n\nTo make the negative form, we add \"not\" after the auxiliary verb \"will\".\n\nExample:\n```\nShe will not have been working here for a year by next month.\n```\n\n### Question Form\n\nTo form questions in the future perfect continuous tense, we use the auxiliary verb \"will\" before the subject, followed by the subject, then \"have been\", and finally the present participle form of the main verb (-ing form).\n\nExample:\n```\nWill they have been studying for the exam for six hours by tomorrow?\n```\n\n## Signal Words\n\nSignal words often associated with the future perfect continuous tense include:\n- For\n- Since\n- How long\n\n## Examples\n\n- **Continuous Duration Until a Future Point**: By the time she arrives, I will have been living here for ten years.\n- **Emphasizing Duration**: By next year, he will have been working at the company for a decade.\n\n## Exercises\n\n1. Complete the sentences with the correct form of the verb:\n   - By the time they get back, I __________ (wait) for two hours.\n   - She __________ (not/study) English for very long by next month.\n   - How long __________ you __________ (read) that book by tomorrow?\n2. Write five sentences describing what you will have been doing for a certain duration by a future point using the future perfect continuous tense."
}
